---
kind: other
id: Properties.T:Autodesk.Revit.DB.LinearArray
source: html/d70e442b-65f3-dd5c-a39c-ca4de2c989e3.htm
---
# LinearArray Properties

The id of the assembly instance to which the element belongs.